Бутина Дарья - «Морской бой по-пиратски» 

Пользовательские сценарии 

Группа: 10 И 1 

Почта: dashabutina@mail.ru 

Куратор: Купцов Александр Александрович 

 

[Сценарий 1 - Регистрация пользователя] 

1) Пользователю необходимо придумать свой уникальный логин, с которым он будет входить в систему. 

2) Пользователю необходимо придумать пароль, с которым он будет входить в систему. 

3) Пользователю необходимо ввести свою google почту для привязки к аккаунту 

4) Если такой логин уже существует в системе, то пользователю сообщается об этом и предлагается придумать новый логин. 

5) Если введённый пароль содержит менее 8-ми символов, то пользователю сообщается об этом и предлагается придумать новый пароль. 

6) Если введенная почта не соответствует формату, то пользователю сообщается об этом и предлагается заново ввести эти данные. 

7) Если все введённые данные соответствуют требованиям регистрации, то система отправляет на почту письмо для подтверждения почты 

8) После подтверждения почты система приветствует пользователя и дарит за регистрацию 500 монет. Далее при ежедневном входе в игру пользователю будут предоставлены ежедневные награды. Чем больше день, тем ценнее награда. 

9) Если пользователь пропустил один из дней обнуляется счетчик и ценность награды. 

10) Запускается Сценарий 2 - Начало игрового процесса. 

 

[Сценарий 2 - Начало игрового процесса] 

1) Пользователю предлагается сделать ставку или выбрать игрока, с которым он будет играть. 

2) Если ставка, сделанная игроком, превышает количество монет, которые имеются у этого игрока, то выводится ошибка и пользователю предлагается ввести ставку меньше. 

3) Если ставка, сделанная игроком, меньше минимальной ставки, то выводится ошибка и пользователю предлагается ввести ставку больше. 

4) Если ставка, сделанная игроком, не превышает количество монет, которые у него имеются и больше минимальной ставки, игрок переходит в режим ожидания. 

5) Если пользователь выбрал игрока, который сделал ставку, превышающую количество монет пользователя, то выводится ошибка и пользователю предлагают выбрать другого игрока. 

6) Если игрок сделал все в соответствии с требованиями, то ему будет предложено выбрать или купить различные бустеры, которыми он хочет пользоваться во время игры. 

7) Если монет на приобретение бустера недостаточно, то появится ошибка и игроку будет предложено выбрать другой бустер. 

8) По истечении 1 минуты начнется игра 

9) Запускается Сценарий 3 - Игровой процесс. 

 

[Сценарий 3 - Игровой процесс] 

1) В течение 1 минуты игроку будет необходимо поставить свои корабли на поле. 

2) Если игрок хочет поставить корабли слишком близко друг к другу, система не даст ему это сделать и высветится предупреждение. 

3) Если игрок не успеет поставить свои корабли, за него это сделает система. 

4) Во время игрового процесса (во время своего хода) игрок может использовать бустеры, выбранные им в Сценарии 2. 

5) По окончанию игры победителю будут начислены монеты равной ставке, на которую играли. У проигравшего игрока будут сняты монеты равной ставке, на которую играли. 

6)По окончанию игры победителю будут начислены очки опыта. Проигравшему - нет. 

7) Система перемещает пользователей в меню. 

8) Запускается Сценарий 4 - Вступление в клан. 

 

[Сценарий 4 - Вступление в клан] 

1) Когда у игрока очки опыта достигают 700 приложение спрашивает, хочет ли он вступить в клан. 

2) Если игрок отвечает “Да”, то приложение перебрасывает пользователя на страницу, где он может выбрать в какой клан ему вступить. 

3) Если игрок отвечает “Нет”, то всплывает подсказка - указатель, где игрок сможет вступить в клан. 

4) Если игрок хочет создать свой собственный клан, он должен перейти на вкладку вступления в клан и нажать на кнопку “Создать клан”. Создание клана будет стоить 2000 монет. 

5) После создания клана игроку будет присвоено звание “Лидер клана”. 

6) Если у игрока не хватает монет на создание клана, то появится ошибка и игроку предложат вступить в уже существующий клан. 

7) Если игрок числится в каком - то клане, то его очки опыта присваиваются так же и клану. 

8) Если игрок является лидером клана у него есть возможность напасть на клан противников. 

9) Запускается Сценарий 5 - Нападение на другие кланы 

 

[Сценарий 5 - Нападение на другие кланы] 

1) Чтобы напасть на другой клан нужно перейти на страницу клана, на который хочешь напасть и нажать кнопку “Напасть на клан”. Далее на специальной вкладке “Сражение” можно отслеживать ход битвы. 

2) Если лидер клана напал на клан противников, у участников есть 2 дня для сражения. 

3) Каждый игрок одного клана может напасть на любого игрока другого клана. Одному игроку нельзя напасть на одного и того же игрока дважды.  

4) При нападении на игрока, с кланом которого у вас сражение, ставку делать не нужно. В конце игры производится начисление очков опыта победившему игроку. 

5) Очки опыта, накопленные во время сражения с другим кланом, суммируется. У кого больше накоплено очков опыта за время сражения, тот и выиграл. Считаются только те очки опыта, которые были присвоены при сражении с участниками другого клана. Победителям начисляются ценные призы. 

 

[Сценарий 6 - Рейтинг] 

1) На вкладке “Рейтинг” можно посмотреть рейтинг участников и рейтинг кланов. 

2) Рейтинг составляется на основе очков опыта. 

3) При выборе участника для сражения список игроков будет выстроен на основе рейтинга. 

4) В профиле игрока будет виден его рейтинг. 

5) Зная номер в рейтинге игрока, можно найти его профиль. 

 

[Сценарий 7 - Чат с другими игроками] 

1) При вступлении или создании клана появится чат, в котором участники клана смогут общаться 

2) При переходе в профиль к другому пользователю, игрок так же может создать с ним чат 
